-- WHERE 조건절 (연산)

-- ======================================================
--  1. 비교연산자
--   1) =
--   2) >
--   3) >= 
--   4) <
--   5) <= 


-- ======================================================
--  2. SQL 연산자 
--   1) BETWEEN a AND b
--   2) IN (list)
--   3) LIKE '비교문자열' -> %, _
--   4) IS NULL 

SELECT ENAME, JOB, DEPTNO
FROM EMP
WHERE (JOB, DEPTNO) IN (('MANAGER', 20), ('CLERK', 30));

SELECT ENAME, JOB, DEPTNO
FROM EMP 
WHERE JOB IN ('MANAGER', 'CLERK')
AND DEPTNO IN (20, 30);

-- ======================================================
--  3. 논리연산
--   1) AND 
--   2) OR 
--   3) NOT 

-- ======================================================
--  4. 부정비교연산자 
--   1) != 
--   2) ^=
--   3) <>
--   4) NOT 컬럼명 = 
--   5) NOT 컬럼명 > 


-- ======================================================
--  5. 부정 SQL 연산자
--   1) NOT BETWEEN a AND b
--   2) NOT IN (list)
--   3) IS NOT NULL 
